<template>
  <div class="article">
    <div>
     <br><br>
    <img src="../assets/d1.png">
    <br>
    <a href="http://www.koreait.ac.kr/new/">http://www.koreait.ac.kr/new/</a>
    <br>
      - 한국 S/W 영재교육원 운영중<br><br>
      - 교육 목표<br>
	    1. 창의 인성을 가진 S/W인재 양성<br>
	    2. 융합 사고 능력을 가진 S/W인재 양성<br>
	    3. 사회를 배려하는 S/W인재 양성<br>
	    4. 핵심 역량을 가진 S/W인재 양성<br><br>
      - 교육원 특징<br>
	    1. 1:1 코칭 시스템 수업 진행<br>
	    2. 차별화된 자체 교육 과정 진행<br>
	    3.1:1 맞춤교육 ( 대학별 전형방법에 따른 1:1 맞춤 교육 진행)<br>
	    4.소프트웨어 영재 육성 교육<br>
	    5.다양한 대외 활동（각종 정보올림피아드, IT경진대회, 자격증 취득)
      <br><br><hr>
   </div><div>
     <br><br>
    <img src="../assets/d2.png">
    <br>
    <a href="http://cyfo.gwangju.ac.kr/">http://cyfo.gwangju.ac.kr/</a>
    <br>
        교육과정특성<br>
	      1. 사이버침해 대응전문가와 ICT 융합보안 전문가 양성을 위한 교육과정 구성<br>
	      2. 사이버침해 대응전문가는 컴퓨터공학을 중심으로 다양한 공격 및 대응방법 학습<br>
	      3. ICT 융합보안 전문가는 컴퓨터 네트워크를 중심으로 프로그래밍 언어와 암호화 학습
      <br><br><hr>
   </div><div>
     <br><br>
    <img src="../assets/d3.png">
    <br>
    <a href="https://www.swu.ac.kr/www/futured_1.html">https://www.swu.ac.kr/www/futured_1.html</a>
    <br>
      교육목표<br>
      1. 지식정보사회 및 유비쿼터스 사회의 핵심정보를 관리하고 보호하는 정보보호 전문가로서 갖춰야 할 기초적 이론과 지식, 기술을 습득하고<br>
      2. 사회의 근간이 되는 핵심 정보를 관리하고 보호하는 전문가에 어울리는 올바른 인성을 함양하며<br>
      3. 미래 사회의 필수기반 기술인 정보보호 기술 분야에서 전문지식과 실무능력, 사회적 책무성을 겸비한 시스템 관리자 및 정보보호 전문가를 양성.<br>
      <br><br><hr>
   </div><div>
     <br><br>
    <img src="../assets/d4.png">
    <br>
    <a href="https://ime.korea.ac.kr/ime/index.do">https://ime.korea.ac.kr/ime/index.do</a>
    <br>
      -정보보호학과<br>
      높은 지식과 능력을 갖춘 정보보호 전문가를 양성하고 정보보호에 관한 연구를 위해 개설되었었다. <br>
      안전한 인터넷 환경과 u-IT 기술 연구 그리고 정보보호 기술, 정보보호 정책 등 정보보호와 관련된 국가 운영 시스템에 공헌하고 있다. <br>
      졸업생들은 한국전자통신연구원(ETRI), 한국인터넷진흥원(KISA), 금융보안연구원(FSA) 등 국가 연구기관이나 삼성, LG와 같은 선두기업, 법률사무소, 경찰정과 같은 다양한 분야에서 일을 하는 중이다.<br><br>

      금융보안학과<br>
      2009년 차세대 금융 보안 전문가를 양성하는 작업의 일환으로 고용계약형 석사과정인 금융보안학과를 신설하였다. <br>
      금융보안학과에서는 전자 금융 전문 인력 양성을 위한 금융 정보보호, 전자금융거래, 스마트폰 등 전자금융과 관련된 전반적인 보안 위협과 대응 기술을 연구하고 있다. <br>
      금융보안 연구원들은 4학기 장학금을 전액 지원 받는 대신, 졸업 후 2년 간 컨소시엄 기업에서 의무적으로 근무해야 한다.<br>
      금융보안학과에는 금융 분야 재직자를 대상으로 하는 재교육형 석사과정인 금융보안정책 전공이 포함되어 있다.<br><br>

      디지털포렌식학과<br>
      첨단 IT 기술이 급속도로 발전하고, 디지털매체가 증거의 보고로 부상함에 따라 범죄 수사 뿐만 아니라 각종 민사소송에 이르기까지 법적 책임과 사실관계를 규명하는 첨단기술인 디지털포렌식의 전문성이 필요한 환경이 증대되고 있다. <br>
      이에 2012년 경찰정 내 직원을 대상으로 형사법·법과학·공학을 학제적으로 교육하는 맞춤형 석사과정인 디지털포렌식 학과를 신설하였다. IT 기술을 근간으로 정책과 기술을 포괄하는 디지털포렌식 전반에 대한 체계적이고 전문화된 교육을 제공함으로써 수사기관의 디지털포렌식 역량을 갖춘 고급 전문 인력 양성을 목표로 하고 있다.<br><br>

      사이버보안학과<br>
      고려대학교 정보보호대학원은 공공기관 직원을 대상으로 사이버 안전전담조직을 전두 지휘할 수 있는 정보보안 최고 관리자 육성을 위한 사이버보안학과를 개설하였습니다.<br>
      사이버보안학과는 위험관리, 보안관제, 사이버공격 대응, 스마트 그리드 보안 등을 체계적으로 집중 교육하고, 이론 중심의 교육에서 탈피하여 현장 중심의 맞춤형 교육을 지향함으로써 이를 통해 국가 사이버 안전 수준을 한 단계 진일보 시킬 수 있는 정보 보안 최고 관리자를 육성하는 것을 목표로 하고 있습니다.
      <br><br><hr>
   </div><div>
     <br><br>
    <img src="../assets/d5.png">
    <br>
    <a href="http://secu.mokpo.ac.kr/">http://secu.mokpo.ac.kr/</a>
    <br>
      -정보보호영재교육원 운영중<br>
      자신의 실력과 나이에 맞게 수업을 들을 수 있도록 세부적으로 교육 과정이 분리가 되어서 진행되고 있다.<br><br>
	    1.중등 기초<br>
		  기초가 되어 있지 않은 학생들을 위한 컴퓨터 기초와 정보보호 기초과정으로 이루어진다.<br>
		  학생들이 정보보호에 관심이 가질 수 있도록 시스템보안, 네트워크 보안, 암호학에 대한 기초적인 내용과 간단한 모의해킹으로 구성되어있다.<br><br>
	    2.중등 심화<br>
		  중등기초에 비해 심화된 학습이 될 수 있도록 과정을 수료한다.<br>
		  리눅스 시스템을 활용한 교육 위주로 구성이 되어있다.<br>
		  시스템보안, 네트워크 보안, 암호학에 대한 심화된 내용과 워게임 사이트를 활용한 모의해킹 실습으로 이루어 진다.<br><br>
	    3.고등 기초 심화<br>
		  고등전문으로 가기 위한 기초 과정으로 중등기초와 중등심화 과정을 모두 포함한다. 초보자를 위해 중등기초과정의 컴퓨터와 네트워크 개념, Python 프로그래밍을 포함중등심화과정과 같은 시스템보안, 네트워크보안, 암호학 과정을 이수하도록 진행된다.<br><br>
	    4.고등 전문(홀수 해)<br>
		  웹해킹과 보안에 특화된 프로그램이다.<br>
		  웹해킹 과정을 위해 웹서버, 데이터베이스, 웹프로그래밍과 같은 기본 교육을 먼저 배우고고 웹해킹 과정을 학습할 수 있도록 한다.<br><br>
	    4-1.고등 전문(짝수 해)<br>
		  리버싱과 디지털포렌식에 특화된 프로그램이다.<br>
		  리버싱과 포렌식에 필요한 운영체제의 프로세스, 파일시스템, 메모리 부분에 대한 기초교육을 먼저 실시하게된다.<br>
		  어셈블리어와 디버거를 활용하여 프로그램을 분석하는 부분을 실습한다.<br>
		  포렌식 도구를 활용하여 시스템과 네트워크 패킷에서 해킹 흔적을 찾고 주요 증거를 찾아 보고하는 과정을 학습한다.
      <br><br><hr>
   </div><div>
     <br><br>
    <img src="../assets/d6.png">
    <br><a href="http://www.sejong.ac.kr/college/software_02_1.html?menu_id=1.12">http://www.sejong.ac.kr/college/software_02_1.html?menu_id=1.12</a>
    <br>
      -교육 목표<br>
	    1. 창의적이고 적극적인 정보보호 전문능력을 소유한 인재의 양성<br>
	    2. 산업현장에서 요구하는 전문적인 실무능력을 보유한 인재의 양성<br>
	    3. 효율적인 의사 전달능력과 기초 소양을 갖춘 인재의 양성<br>
	    4. 올바른 직업윤리와 국제 감각을 갖춘 인재의 양성
      <br><br>
   </div>
  </div>
</template>

<style scoped>
.article {
  min-height: 400px;
  padding: 15%;
  padding-top: 20px;
}
</style>